I can confirm that Infrastructure apps have no drift now in 5.7.1

These still have issues
policies id and service_auth_401_redirect for self_hosted in cloudflare_zero_trust_access_application

update -> cloudflare_zero_trust_tunnel_cloudflared_route
```
  # cloudflare_zero_trust_tunnel_cloudflared_route.x will be updated in-place
  ~ resource "cloudflare_zero_trust_tunnel_cloudflared_route" "x" {
      ~ created_at         = "2025-07-15T14:48:18Z" -> (known after apply)
      + deleted_at         = (known after apply)
        id                 = "x"
        # (5 unchanged attributes hidden)
    }
```
importing -> cloudflare_zero_trust_tunnel_cloudflared
```
  ~ resource "cloudflare_zero_trust_tunnel_cloudflared" "x" {
      ~ account_tag       = "x" -> (known after apply)
      + config_src        = "local"
      ~ connections       = [] -> (known after apply)
      + conns_active_at   = (known after apply)
      ~ conns_inactive_at = "2024-07-04T08:19:39Z" -> (known after apply)
      ~ created_at        = "2024-01-20T20:24:24Z" -> (known after apply)
      ~ deleted_at        = "2025-05-13T11:41:35Z" -> (known after apply)
        id                = "x"
      ~ metadata          = jsonencode({}) -> (known after apply)
        name              = "x"
      ~ remote_config     = false -> (known after apply)
      ~ status            = "down" -> (known after apply)
      ~ tun_type          = "cfd_tunnel" -> (known after apply)
      + tunnel_secret     = (sensitive value)
        # (1 unchanged attribute hidden)
    }
```
config_src and tunnel_secret are not imported 